// 2) ახსენით როგორ მუშაობს for loop-ი. ასევე, დაწერეთ რამდენი არგუმენტი გადაეცემა მას და თითოეული არგუმენტი რას ასრულებს?
// for loop ი ჩვენს გვაძლევს საშვალებას რომ გამოვიტანოთ ნებისმიერი რამ რამდენჯერაც გვინდა 
// აქსვ სამი არგუმენტი:
// start-დაწყება
// stop-დამტავრება
// step-რამდენით გაიზარდოს




// 3) დაწერეთ for loop-ი, რომელიც რიცხვებს დაითვლის 25-დან 30-მდე.
for(let i = 25; i < 30; i++){
    console.log(i);
}



// 4) დაწერეთ for loop-ი, რომელიც რიცხვებს დაითვლის 90-დან 102-ის ჩათვლით, 2-2 რიცხვის გამოტოვებით.

for(let num = 90; num <=102; num += 2){
    console.log(num);
}



// 5) დაწერეთ for loop-ი, რომელიც რიცხვებს 90-დან 50-მდე დაითვლის.

for(let num2 = 90 ; num2 >= 50 ; num2--){
    console.log(num2);
}


// 6) დაწერეთ for loop-ი, რომელიც რიცხვებს 45-დან 20-მდე დაითვლის, 5-5 რიცხვის გამოკლებით.

for(let num3 = 45 ; num3 > 20 ; num3 -= 5){
    console.log(num3);
}


// 7) შექმენით ცვლადი და შეინახეთ მასში თქვენი სახელი. გადაუარეთ for loop-ით ისე, რომ სტრინგის ყველა სიმბოლო და 
// თითოეულის
//  ინდექსი ერთად დალოგოთ კონსოლში.

let name = "Giorgi"

for(let y = 0 ;  y < name.length ; y++){
    console.log(y , name[y]);
}

// 8) ახსენი, თუ რა მნიშვნელობა აქვს stopping condition-ის ადგილას length კუთვნილების გამოყენებას, for loop-ის სტრინგზე/მასივზე 
// გადავლისას.
// როცა length-ს ვიყენებთ ციკლი მხოლოდ იმ მანძილზე იტრიალებს რამდენიც არის variable.



// 9) დაწერეთ for loop-ი, რომელიც რიხცვების სიას გადაუვლის და მსგავს ფორმატში გამოიტანს: 'Number: {x}'


let numbers = [10, 25, 42, 50, 99];

for (let x = 0; x < numbers.length; x++) {
    console.log("Number:" + numbers[x]);
}


