# 4) ინტერნეტში მოიძიეთ და დაწერეთ თუ ძირითადად რა ტიპის Error-ებს ვხვდებით Python-ში. (მაგ. TypeError და ა.შ)





# Python-ში
# შეცდომები (exceptions) სხვადასხვა ტიპისაა, მაგრამ ძირითადად ისინი წარმოიქმნება მაშინ,
# როცა კოდი არასწორად არის დაწერილი ან არასწორად მუშაობს შესრულების დროს. ერთ-ერთი 
# ყველაზე გავრცელებული შეცდომაა SyntaxError, რომელიც ჩნდება მაშინ, როცა კოდი არ შეესაბამება
# Python-ის სინტაქსის წესებს, მაგალითად როცა გვავიწყდება ორწერტილი ან ფრჩხილი. მასთან ახლოს
# დგას IndentationError, რომელიც დაკავშირებულია არასწორ დაშორებებთან (indentation), რადგან 
# Python-ში კოდის სტრუქტურა სწორად შეწევაზეა დამოკიდებული.
