# HARD LVL:
# 9) დაწერეთ ოთახის გაგრილების სისტემის პროგრამა, but there’s a twist:

# ჩათვალეთ, რომ პროგრამა მხოლოდ იმ შემთხვევაში აღიქვამს ოთახის ტემპერატურას, თუ იგი ფარენგეიტშია გადმოცემული.
#  (სისტემა ჩაირთვება მაშინ, როდესაც ტემპერატურა 89.6 ფარენგეიტს ასცდება). 
# ერთადერთი გასათვალისწინებელი ფაქტი ის არის, რომ მომხმარებელს ოთახის ტემპერატურა გრადუსებში შემოაქვს. 

# ეცადეთ დაწეროთ პირობის მიხედვით ისეთი ოთახის გაგრილების სისტემის პროგრამა, რომელიც სწორად იმუშავებს 

num1 = float(input("Enter your number in celsius: "))

transformation = (num1 - 32)
final = transformation/1.8
norm_temp = 89.6
ac = norm_temp>final

print(ac)