// <!-- 1)კომენტარების სახით ახსენით თუ რაარის js და რაში ვიყენებთ მას

// js-JavaScript არის ენა რომელსაც ვიყენებთ ჩვენი ვებსაიტის ასამუშავებლათ 


// 2)ახსენით რაარის if else და როგორ მუშაობენ ისინი

// if else არის შემოწმების ოპერატორები



// 3)კომენტარების სახით ახსენით თუ რაგანსხვავებაა const და let შორის

// როდესაც ჩვენ ვიყენებთ let-ს ნებისმიერ დროს შეგვიძლია შევუცვალოთ variable-ს მნიშვნელობა ხოლო თუ ჩვენ გამოვიყენებთ const-ს მაშინ
// მნიშვნელობას ვეღარ შევცვლით


// 4)შექმენით ერთი ცვლადი სადაც შეინახავთ ასაკს და შეამოწმეთ თუ ასაკი მეტია ან ტოლია 18 ზე გამოუტანეთ სრულწოვანი და
//  თუ არაა არასრულწოვანი


let age = 18

if(age >= 18){
    console.log("სრულწლოვანი")
}else{
    console.log("არა სრულწლოვანი")
}


// 5)კომენტარების სახით ახსენით თუ რაარის ternary operator და როგორ მუშაობს გააკეთეთ ერთი მაგალითი



// 6)კომენტარების სახით ახსენით თუ როგორ მუშაობს .pop() .length() .push() მეთოდები

// .pop - აგდებ ბოლო ასოს მნიშვნელობიდან
// .push() - ამატებს ასოს ბოლოდან
// .length() - გვიჩვენებს თუ რამდენ ასოს შეიცავს ჩვენი სიტყვა

// 7)შექმენით ხილის სია სადაც შეინახავთ თქვენთვის სასურველ ხილს და საბოლოოდ დაბეჭდეთ თუ რამდენი ელემენტია
//  ამ სიაში

let fruits = ["apple" , "pear" , "banana" ]

console.log(fruits.length)

// 8)შექმენით ერთი მასივი სადაც შეინახავთ სახელებს და შემდეგ დაამატეთ 2 სახელი და დაბეჭდეთ განახლებული მასივი

let names = ["Giorgi" , "Luka" , "Gabrieli"]

names.push("Nika")
names.push("Daviti")
console.log(names)



// 9)გაქვს მასივი numbers = [5, 10, 15, 20, 25]. წაშალე მასივიდან ბოლო ელემენტი .pop()-ით ხოლო წაშლილი მნიშვნელობა შეინახე 
// #ცალკე ცვლადში removedNum ში და დაბეჭდე კონსოლში

numbers = [5, 10, 15, 20, 25]

removedNum = numbers.pop()

console.log(removedNum)


// 10)გაქვს მასივი scores = [50, 65, 78, 92, 45, 88, 99]. .slice() მეთოდის გამოყენებით ამოჭერი და ცალკე მასივში შეინახე ბოლო
//  3 ქულა

scores = [50, 65, 78, 92, 45, 88, 99]

onlyThree = scores.slice(-3)

console.log(onlyThree)


// 11)კომენტარების სახით ახსენით თუ რაარის Class და რაში ვიყენებთ მას

// 12)შექმენით Person კლასი რომელსაც ექნება შემდეგი ატრიბუტები: name,lastname,age,city და ასევე  შექმენით მეთოდი getFullName(), რომელიც დააბრუნებს პიროვნების სრულ სახელსა და გვარს (მაგალითად: "ნიკოლოზ ყველაშვილი
// ") და საბოლოოდ გამოიძახეთ და გატესტეთ
// 13)კომენტარების სახით ახსენით თუ რას ნიშნავს Class Inheritence
// 14)კომენტარების სახით ახსენით თუ რასაკეთებს super()
// 15)კომენტარების სახით ახსენით თუ რაარის  instance