# 2) Web-ში დასერჩეთ ინფორმაცია Python-ის შესახებ.  ყველაზე მნიშვნელოვანი მასალა ამოიწერეთ Level 01-ის Homework ფაილში და გამოიტანეთ print()-ის საშუალებით.
print("პითონი არის ერთერთი მნიშვნელოვანი პროგრამული ენა")
print("პითონი გამოიყენება ვებ დეველოპმენტში ასევე კიბერ უსაფრთხოებაში")
print("პითონი არის ერთერთი მარტივი ენა და მისი შესწავლა დამწყებებისათვის არის კარგი")
# 3) კომენტარის სახით ახსენით, თუ რას აკეთებს print() ბრძანება Python-ში.

# 4) შექმენით 2 ცვლადი: ორივე Integer ტიპის. პირველ ცვლადში შეინახეთ თქვენი ასაკი, მეორე ცვლადში კი თქვენი მეგობრის. ორივე გამოიტანეთ ცალ-ცალკე ხაზებზე.

# 5) შექმენით 3 ცვლადი. სამივე ცვლადში String ტიპის მონაცემი შეინახეთ. შემდეგ print() - ში სცადეთ რომ სამივე ცვლადის სახელი ერთმანეთთან შეართოთ + ოპერატორის საშუალებით. დააკვირდით შედეგს.

# 6) აუცილებლად ყველამ გადახედეთ გაკვეთილის მეორე ნახევარს ხელმეორედ.

# # 7) დაიმატეთ ყველა ჯგუფის წევრი მეგობრებში და დაახლოვდით :)






