<<<<<<< HEAD
# 6) მომხმარებელს შემოატანინეთ ტემპერატურა ცელსიუსში. დაწერეთ პროგრამა,
# რომელიც მომხმარებლის მიერ შემოტანილ ტემპერატურას გადაიყვანს ფარენგეიტში და დაბეჭდეთ
# საბოლოო შედეგი. (მოიძიეთ ფორმულა ინტერნეტში)


num1 = int(input("Enter your number in celsius: "))

fahrenheit = int(num1)*1.8 
final = int(fahrenheit)+32
print(final)
=======
# 6) მომხმარებელს შემოატანინეთ ტემპერატურა ცელსიუსში. დაწერეთ პროგრამა, რომელიც 
# მომხმარებლის მიერ შემოტანილ ტემპერატურას გადაიყვანს ფარენგეიტში და დაბეჭდეთ საბოლოო შედეგი. 
# (მოიძიეთ ფორმულა ინტერნეტში)
 

num1 = int(input("Enter number in celsius: "))

fahrenheit = (num1 * 1.8) + 32

print(fahrenheit)
>>>>>>> b517936d5d3090d2aee13860d3b4a07ed4368610
