<<<<<<< HEAD
# 7) მეხუთე დავალების მსგავსად, შემოატანინეთ მომხმარებელს ტემპერატურა, თუმცა ამჯერად -
# ფარენგეიტში. შემდეგ კი დაწერეთ პროგრამა, 
# რომელიც შემოტანილ ტემპერატურას ცელსიუსში გადაიყვანს და საბოლოოდ დაბეჭდეთ შედეგი.


num1 = int(input("Enter your number in fahrenheit: "))

celsius = int(num1)-32
final = int(celsius)//1.8
print(final)
=======
# 7) მეხუთე დავალების მსგავსად, შემოატანინეთ მომხმარებელს ტემპერატურა, თუმცა ამჯერად 
# - ფარენგეიტში. შემდეგ კი დაწერეთ პროგრამა, რომელიც შემოტანილ ტემპერატურას ცელსიუსში
#  გადაიყვანს და საბოლოოდ დაბეჭდეთ შედეგი.


num1  = int(input("Enter number in fahrenheit: "))

Celsius = (num1-32)//1.8
print(Celsius)
>>>>>>> b517936d5d3090d2aee13860d3b4a07ed4368610
